
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>A Survey on Transfer Learning · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    基础介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../基础理论补充/">
            
                <a href="../基础理论补充/">
            
                    
                    1.基础理论补充
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.2.1" data-path="../基础理论补充/基础概念.html">
            
                <a href="../基础理论补充/基础概念.html">
            
                    
                    基础概念
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="./">
            
                <a href="./">
            
                    
                    2.迁移学习论文研读
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter active" data-level="1.3.1" data-path="A Survey on Transfer Learning.html">
            
                <a href="A Survey on Transfer Learning.html">
            
                    
                    A Survey on Transfer Learning
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >A Survey on Transfer Learning</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>[TOC]</p>
<h1 id="&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x7EFC;&#x8FF0;">&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7814;&#x7A76;&#x7EFC;&#x8FF0;</h1>
<blockquote>
<p>&#x91CD;&#x70B9;&#x662F;&#x5206;&#x7C7B;&#x5F53;&#x524D;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x7C7B;&#x3001;&#x56DE;&#x5F52;&#x548C;&#x805A;&#x7C7B;&#x95EE;&#x9898;&#x3002; &#x672C;&#x6587;&#x8BA8;&#x8BBA;&#x4E86;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4E0E;&#x9886;&#x57DF;&#x81EA;&#x9002;&#x5E94;&#x3001;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x3001;&#x6837;&#x672C;&#x9009;&#x62E9;&#x504F;&#x5DEE;&#x3001;&#x534F;&#x53D8;&#x91CF;&#x8F6C;&#x79FB;&#x7B49;&#x76F8;&#x5173;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB; </p>
</blockquote>
<h2 id="&#x5F15;&#x8A00;">&#x5F15;&#x8A00;</h2>
<p>&#x76EE;&#x6807;&#xFF1A;&#x5C06;&#x4E00;&#x4E2A;&#x5904;&#x5728;&#x6E90;&#x57DF;&#x4E0A;&#x7684;&#x6A21;&#x578B;&#x7528;&#x5728;&#x76EE;&#x6807;&#x57DF;&#x4E0A;&#x7684;&#x6A21;&#x578B;&#x4E0A;</p>
<h2 id="&#x6982;&#x8FF0;">&#x6982;&#x8FF0;</h2>
<h3 id="&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7B80;&#x53F2;">&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7B80;&#x53F2;</h3>
<ol>
<li>&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7684;&#x65B0;&#x804C;&#x8D23;&#xFF1A;&#x7CFB;&#x7EDF;&#x8BC6;&#x522B;&#x5E76;&#x5E94;&#x7528;&#x4ECE;&#x4EE5;&#x524D;&#x4EFB;&#x52A1;&#x4E2D;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x77E5;&#x8BC6;&#x6216;&#x6280;&#x80FD;&#x5230;&#x65B0;&#x4EFB;&#x52A1;&#x7684;&#x80FD;&#x529B;&#xFF08;&#x65E8;&#x5728;&#x4ECE;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6E90;&#x4EFB;&#x52A1;&#x4E2D;&#x63D0;&#x53D6;&#x77E5;&#x8BC6;&#xFF09;</li>
<li>&#x76F8;&#x6BD4;&#x4E8E;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#xFF0C;&#x5B83;&#x66F4;&#x52A0;&#x6CE8;&#x91CD;&#x4E8E;&#x76EE;&#x6807;&#x4EFB;&#x52A1;</li>
</ol>
<h3 id="&#x7B26;&#x53F7;&#x5B9A;&#x4E49;">&#x7B26;&#x53F7;&#x5B9A;&#x4E49;</h3>
<ul>
<li>&#x6E90;&#x57DF;$$D$$&#xFF1A;&#x5305;&#x542B;&#x4E86;&#x7279;&#x5F81;&#x7A7A;&#x95F4; $$\chi$$&#x548C;&#x8FB9;&#x7F18;&#x5206;&#x5E03;&#x6982;&#x7387;$$P(\chi)$$, &#x4F8B;&#x5982;$$\chi$$&#x662F;&#x6240;&#x6709;&#x6837;&#x672C;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;$$\chi_i$$&#x662F;&#x67D0;&#x4E00;&#x4E9B;&#x6837;&#x672C;&#x7684;&#x5BF9;&#x5E94;&#x7684;&#x5411;&#x91CF;&#xFF0C;$$X$$&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x5B66;&#x4E60;&#x6837;&#x672C;&#x3002;&#x7ED9;&#x5B9A;&#x4E00;&#x4E2A;&#x6E90;&#x57DF;$$D=\big( \chi,P(\chi))$$&#xFF0C;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;&#x6807;&#x7B7E;&#x57DF;$$y$$ &#x548C;&#x9884;&#x6D4B;&#x51FD;&#x6570;$$f()$$,&#x6BCF;&#x4E00;&#x4E2A;&#x8BAD;&#x7EC3;&#x5BF9;&#x8C61;&#x90FD;&#x5305;&#x62EC;&#x4E86;$$(x_i,y_i)$$&#x3002;&#x4ECE;&#x6982;&#x7387;&#x7684;&#x89C2;&#x70B9;&#x6765;&#x770B;$$f(x)$$&#x53EF;&#x4EE5;&#x88AB;&#x5199;&#x4E3A;$$P(y|x)$$</li>
<li><strong>&#x5B9A;&#x4E49;1(&#x8FC1;&#x79FB;&#x5B66;&#x4E60;)</strong>&#xFF1A;&#x7ED9;&#x5B9A;&#x6E90;&#x57DF;$$D_S$$&#x548C;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;$$T_s$$&#xFF0C;&#x76EE;&#x6807;&#x57DF;$$D_T$$ &#x548C;&#x5B66;&#x4E60;&#x4EFB;&#x52A1;$$T_T$$&#xFF0C;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65E8;&#x5728;&#x4F7F;&#x7528;$$D_S$$&#x548C;$$T_S$$&#x4E2D;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x5E2E;&#x52A9;&#x4F18;&#x5316;&#x5728;$$D_T$$&#x4E2D;&#x7684;&#x9884;&#x6D4B;&#x51FD;&#x6570;$$f()$$&#x3002;</li>
<li>&#x5728;&#x4E0A;&#x9762;&#x7684;&#x5B9A;&#x4E49;&#x4E2D;$$D_s \neq D_t$$&#xFF0C;&#x610F;&#x5473;&#x7740;&#x6E90;&#x57DF;&#x548C;&#x76EE;&#x6807;&#x57DF;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E0D;&#x540C;&#x6216;&#x8FB9;&#x7F18;&#x5206;&#x5E03;&#x6982;&#x7387;&#x51FD;&#x6570;&#x4E0D;&#x76F8;&#x540C;; &#x5F53;$$T_s \neq T_t$$ &#x5219;&#x610F;&#x5473;&#x7740;&#x6807;&#x7B7E;&#x7A7A;&#x95F4;&#x4E0D;&#x540C;&#x6216;&#x6761;&#x4EF6;&#x8FB9;&#x7F18;&#x5206;&#x5E03;&#x6982;&#x7387;&#x4E0D;&#x540C;</li>
<li>&#x82E5;&#x6E90;&#x57DF;&#x548C;&#x76EE;&#x6807;&#x57DF;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x5B58;&#x5728;&#x67D0;&#x79CD;&#x663E;&#x5F0F;&#x6216;&#x9690;&#x5F0F;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x6211;&#x4EEC;&#x5219;&#x79F0;&#x4ED6;&#x4EEC;&#x76F8;&#x5173;&#x3002;</li>
</ul>
<h3 id="&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#x5206;&#x7C7B;">&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x6280;&#x672F;&#x7684;&#x5206;&#x7C7B;</h3>
<ol>
<li><p>&#x4E09;&#x4E2A;&#x95EE;&#x9898;&#xFF08;&#x8FC1;&#x79FB;&#x4EC0;&#x4E48;&#xFF0C;&#x5982;&#x4F55;&#x8FC1;&#x79FB;&#xFF0C;&#x4F55;&#x65F6;&#x8FC1;&#x79FB;&#xFF09;&#xFF1A;</p>
<ul>
<li><p>&#x8FC1;&#x79FB;&#x4EC0;&#x4E48;</p>
<p>&#x6709;&#x4E9B;&#x77E5;&#x8BC6;&#x5728;&#x4E0D;&#x540C;&#x57DF;&#x4E4B;&#x95F4;&#x53EF;&#x80FD;&#x662F;&#x901A;&#x7528;&#x7684;</p>
</li>
<li><p>&#x4F55;&#x65F6;&#x8FC1;&#x79FB;</p>
<p>&#x5E94;&#x5F53;&#x955C;&#x50CF;&#x6280;&#x80FD;&#x8F6C;&#x79FB;&#xFF0C;&#x6709;&#x4E9B;&#x65F6;&#x5019;&#x77E5;&#x8BC6;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x8F6C;&#x79FB;&#xFF08;&#x8D1F;&#x8FC1;&#x79FB;&#xFF09;</p>
</li>
</ul>
</li>
<li><p>&#x4E09;&#x79CD;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;
<img src="../images/1618906971406.png" alt="1618906971406"></p>
<ol>
<li>&#x5728;&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x4E0D;&#x540C;&#x57DF;&#x6E90;&#x4EFB;&#x52A1;&#xFF0C;&#x6B64;&#x65F6;&#x9700;&#x4ECE;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x9009;&#x53D6;&#x4E00;&#x4E9B;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x6765;&#x63A8;&#x65AD;&#x5BA2;&#x89C2;&#x9884;&#x6D4B;&#x6A21;&#x578B;<ul>
<li>&#x5F53;&#x6E90;&#x57DF;&#x4E2D;&#x6709;&#x5F88;&#x591A;&#x6570;&#x636E;&#x662F;&#x53EF;&#x7528;&#x7684;&#x65F6;&#xFF0C;&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;&#x7C7B;&#x4F3C;&#x4E8E;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;</li>
<li>&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x6570;&#x636E;&#x65F6;&#xFF0C;&#x5E94;&#x91C7;&#x7528;&#x81EA;&#x5B66;&#x8BBE;&#x7F6E;&#x3002;</li>
</ul>
</li>
<li>&#x5728;&#x8F6C;&#x5BFC;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;&#x4E2D;&#xFF0C;&#x6E90;&#x4EFB;&#x52A1;&#x4E0E;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x6E90;&#x57DF;&#x4E0E;&#x76EE;&#x6807;&#x57DF;&#x4E0D;&#x540C;&#x3002;&#x6B64;&#x65F6;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x6CA1;&#x6709;&#x6570;&#x636E;&#x53EF;&#x7528;&#x3002;&#x6B64;&#x65F6;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x3002;<ul>
<li>&#x6E90;&#x57DF;&#x548C;&#x76EE;&#x6807;&#x57DF;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E0D;&#x540C;</li>
<li>&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8FB9;&#x7F18;&#x5206;&#x5E03;&#x6982;&#x7387;&#x4E0D;&#x540C;&#x3002;</li>
</ul>
</li>
<li>&#x5728;&#x65E0;&#x76D1;&#x7763;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;&#x4E2D;&#xFF0C;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x4E0E;&#x6E90;&#x4EFB;&#x52A1;&#x4E0D;&#x540C;&#x4F46;&#x76F8;&#x5173;&#x3002;&#x6B64;&#x65F6;&#x6CA1;&#x6709;&#x53EF;&#x7528;&#x7684;&#x6570;&#x636E;</li>
</ol>
</li>
<li><p>&#x4EE5;&#x4E0A;&#x4E09;&#x79CD;&#x60C5;&#x51B5;&#x7684;&#x603B;&#x7ED3;
<img src="../images/1618907822531.png" alt="1618907822531">
<img src="../images/1618907926866.png" alt="1618907926866"></p>
<blockquote>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x88AB;&#x79F0;&#x4E3A;&#x57FA;&#x4E8E;&#x5B9E;&#x4F8B;&#x7684;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x7279;&#x5F81;&#x8868;&#x793A;&#x8F6C;&#x79FB;&#x65B9;&#x6CD5;&#xFF0C;&#x7B2C;&#x4E09;&#x79CD;&#x662F;&#x53C2;&#x6570;&#x8F6C;&#x79FB;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x53EF;&#x4EE5;&#x88AB;&#x79F0;&#x4E3A;&#x5173;&#x7CFB;&#x53EA;&#x662F;&#x8F6C;&#x79FB;&#x65B9;&#x6CD5;&#x3002;</p>
</blockquote>
</li>
<li><p>&#x4E0B;&#x8868;&#x662F;&#x5BF9;&#x51E0;&#x7C7B;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x7684;&#x603B;&#x7ED3;
<img src="../images/1618908245640.png" alt="1618908245640">
<img src="../images/1618908291498.png" alt="1618908291498"></p>
</li>
</ol>
<h2 id="&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;">&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;</h2>
<ol>
<li><strong>&#x5B9A;&#x4E49;2(&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;)</strong>&#xFF1A;&#x7ED9;&#x5B9A;&#x6E90;&#x57DF; $$D_S$$ &#x548C;&#x5B66;&#x4E60;&#x4EFB;&#x52A1; $$T_S$$ ,&#x76EE;&#x6807;&#x57DF; $$ D_T $$ &#x548C; $$ T_T $$ &#xFF0C;&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65E8;&#x5728;&#x7528;&#x5728; $$D_S $$ &#x548C; $$T_S$$ &#x4E0A;&#x7684;&#x77E5;&#x8BC6;&#x4F18;&#x5316;&#x5728;$$ D_T $$&#x4E0A;&#x76EE;&#x6807;&#x68C0;&#x6D4B;&#x51FD;&#x6570;$$ f_T() $$</li>
<li>&#x5927;&#x591A;&#x6570;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x503E;&#x5411;&#x4E8E;&#x5E94;&#x7528;&#x4E8E;&#x6E90;&#x57DF;&#x4E2D;&#x7684;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x53EF;&#x7528;</li>
</ol>
<h3 id="&#x4F20;&#x9012;&#x5B9E;&#x4F8B;&#x7684;&#x77E5;&#x8BC6;">&#x4F20;&#x9012;&#x5B9E;&#x4F8B;&#x7684;&#x77E5;&#x8BC6;</h3>
<ol>
<li><code>boosting</code>&#x7B97;&#x6CD5;<code>TrAdaBoost</code>&#xFF1A;&#x5047;&#x5B9A;&#x6E90;&#x57DF;&#x3001;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F46;&#x5206;&#x5E03;&#x4E0D;&#x540C;&#x3002;&#x5B83;&#x8BD5;&#x56FE;&#x4FEE;&#x6539;&#x6E90;&#x57DF;&#x6570;&#x636E;&#x7684;&#x52A0;&#x6743;&#xFF0C;&#x9F13;&#x52B1;&#x201C;&#x597D;&#x201D;&#x6570;&#x636E;&#xFF0C;&#x51CF;&#x5C11;&#x201C;&#x574F;&#x201D;&#x6570;&#x636E;&#x7684;&#x5F71;&#x54CD;&#xFF1B;&#x8BEF;&#x5DEE;&#x4EC5;&#x5728;&#x76EE;&#x6807;&#x6570;&#x636E;&#x4E0A;&#x8BA1;&#x7B97;</li>
</ol>
<h3 id="&#x4F20;&#x9012;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;">&#x4F20;&#x9012;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;</h3>
<p>&#x627E;&#x5230;&#x597D;&#x7684; &#x7279;&#x5F81;&#x8868;&#x793A;&#x53EF;&#x4EE5;&#x6700;&#x5C0F;&#x5316;&#x9886;&#x57DF;&#x8BEF;&#x5DEE;&#x548C;&#x5206;&#x7C7B;/&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x8BEF;&#x5DEE;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x540C;&#x7684;&#x6E90;&#x57DF;&#x6570;&#x636E;&#xFF0C;&#x5BFB;&#x627E;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x7B56;&#x7565;&#x4E0D;&#x540C;&#x3002;</p>
<ol>
<li>&#x5F53;&#x6709;&#x5927;&#x91CF;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x53EF;&#x7528;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x6765;&#x6784;&#x5EFA;&#x7279;&#x5F81;&#x8868;&#x793A;</li>
<li>&#x82E5;&#x6CA1;&#x6709;&#xFF0C;&#x5219;&#x4F7F;&#x7528;&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<h4 id="&#x6709;&#x76D1;&#x7763;&#x7279;&#x5F81;&#x6784;&#x5EFA;">&#x6709;&#x76D1;&#x7763;&#x7279;&#x5F81;&#x6784;&#x5EFA;</h4>
<p>&#x8FD9;&#x91CC;&#x7528;&#x5230;&#x7684;&#x65B9;&#x6CD5;&#x7C7B;&#x4F3C;&#x4E8E;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<ul>
<li><p>&#x57FA;&#x672C;&#x601D;&#x60F3;&#xFF1A;&#x5B66;&#x4E60;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x5728;&#x76F8;&#x5173;&#x4EFB;&#x52A1;&#x91CC;&#x5171;&#x4EAB;&#x7684;&#x4F4E;&#x7EF4;&#x8868;&#x793A;&#x3002;</p>
</li>
<li><p>&#x6027;&#x7684;&#x8868;&#x793A;&#x65B9;&#x6CD5;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x6BCF;&#x4E2A;&#x4EFB;&#x52A1;&#x7684;&#x5206;&#x7C7B;&#x6216;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x8BEF;&#x5DEE;</p>
</li>
<li><p><code>Argyrious</code>&#x7B49;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x7684;&#x7A00;&#x758F;&#x7279;&#x5F81;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5728;&#x5F52;&#x7EB3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x8BBE;&#x7F6E;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x6765;&#x5B66;&#x4E60;&#x5E38;&#x89C1;&#x7279;&#x5F81;</p>
</li>
</ul>
<pre><code> $$
 \begin{aligned}
</code></pre><p>  &amp;{arg \min}<em>{A,U} \sum\limits</em>{t\in{T,S}} \sum\limits<em>{i=1}^{n_t} {L(y</em>{t<em>i},\langle a_t,U^Tx</em>{t<em>i}\rangle)+\gamma {||A||}</em>{2,1}^2} \ 
  &amp; s.t. \qquad U \in {O}^d 
  \end{aligned}</p>
<p>  $$</p>
<blockquote>
<p>A&#x662F;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x77E9;&#x9635;&#xFF0C;U&#x662F;&#x4E00;&#x4E2A;d*d&#x7684;&#x6620;&#x5C04;&#x51FD;&#x6570;&#xFF0C;&#x7528;&#x4E8E;&#x5C06;&#x539F;&#x59CB;&#x9AD8;&#x4F4D;&#x6570;&#x636E;&#x4F4E;&#x7EF4;&#x5316;&#xFF1B;$${||A||}<em>{r,p}:=(\sum\limits</em>{i=1}^d{||a^i||}_t^p)^{\frac{1}{p}}$$&#xFF1B;&#x4F18;&#x5316;&#x95EE;&#x9898;&#xFF08;1&#xFF09;&#x53EF;&#x4EE5;&#x8F6C;&#x5316;&#x4E3A;&#x7B49;&#x4EF7;&#x7684;&#x51F8;&#x4F18;&#x5316;&#x516C;&#x5F0F;</p>
</blockquote>
<ul>
<li><p>&#x540E;&#x7EED;&#x7684;&#x5DE5;&#x4F5C;</p>
<ul>
<li>&#x63D0;&#x51FA;&#x4E86;&#x591A;&#x4EFB;&#x52A1;&#x7ED3;&#x6784;&#x5B66;&#x4E60;&#x7684;&#x77E9;&#x9635;&#x6B63;&#x5219;&#x5316;&#x6846;&#x67B6;&#xFF1B;</li>
<li>&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x51F8;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x4ECE;&#x9884;&#x6D4B;&#x4EFB;&#x52A1;&#x7684;&#x96C6;&#x5408;&#x4E2D;&#x540C;&#x65F6;&#x5B66;&#x4E60;&#x5143;&#x5148;&#x9A8C;&#x548C;&#x7279;&#x5F81;&#x6743;&#x91CD;&#xFF1B;</li>
<li>&#x63D0;&#x51FA;&#x4E86;&#x7528;SVMs&#x9009;&#x62E9;&#x591A;&#x4EFB;&#x52A1;&#x5B66;&#x4E60;&#x7684;&#x7279;&#x5F81;</li>
<li>&#x8BBE;&#x8BA1;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x5185;&#x6838;&#x7684;&#x5F52;&#x7EB3;&#x4F20;&#x8F93;&#x65B9;&#x6CD5;</li>
</ul>
</li>
</ul>
<h4 id="&#x65E0;&#x76D1;&#x7763;&#x7279;&#x5F81;&#x6784;&#x5EFA;">&#x65E0;&#x76D1;&#x7763;&#x7279;&#x5F81;&#x6784;&#x5EFA;</h4>
<ul>
<li><p>&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x7A00;&#x758F;&#x7F16;&#x7801;&#xFF0C;&#x7528;&#x4EE5;&#x5B66;&#x4E60;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7279;&#x5F81;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#xFF1A;</p>
<ol>
<li><p>&#x901A;&#x8FC7;&#x5728;&#x6E90;&#x57DF;&#x6570;&#x636E;&#x4E0A;&#x89E3;&#x51B3;&#x5982;&#x4E0B;&#x7684;&#x4F18;&#x5316;&#x95EE;&#x9898;&#x800C;&#x4EA7;&#x751F;&#x4E86;&#x9AD8;&#x9636;&#x57FA;&#x5411;&#x91CF;$$b={b<em>1,b_2,...,b_s}$$
$$
\begin{aligned}
\min\limits</em>{a,b} \sum\limits<em>{i}||x</em>{S<em>i}-\sum\limits_j{a</em>{S<em>i}^jb_j}||_2^2+\beta||a</em>{S_i}||_1\
s.t. \qquad ||b_j||_2 \leq 1,\quad \forall j\in1,...,s.
\end{aligned}
$$</p>
<blockquote>
<p>$$a<em>{S_i}^j$$&#x662F;&#x8F93;&#x5165;$$x</em>{S_i}$$&#x5728;&#x65B0;&#x7684;&#x57FA;$$b_j$$&#x4E0B;&#x7684;&#x8868;&#x793A;&#xFF0C;$$\beta$$&#x662F;&#x5E73;&#x8861;&#x4E86;&#x7279;&#x5F81;&#x6784;&#x9020;&#x9879;&#x548C;&#x6B63;&#x5219;&#x5316;&#x9879;&#x7684;&#x7CFB;&#x6570;.</p>
</blockquote>
</li>
<li><p>&#x5B66;&#x4E60;&#x5B8C;&#x57FA;&#x5411;&#x91CF; $$b<em>i$$ &#x540E;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x76EE;&#x6807;&#x6570;&#x636E;&#x5E94;&#x7528;&#x4E0B;&#x5217;&#x4F18;&#x5316;&#x7B97;&#x6CD5;&#xFF0C;&#x8BA9; $$b_i$$ &#x5B66;&#x4E60;&#x5230;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7279;&#x5F81;
$$
a</em>{T<em>i}^*=\arg \min\limits</em>{a<em>{T_i}}\lVert x</em>{T<em>i}-\sum\limits_ja</em>{T<em>i}^jb_j\rVert_2^2+\beta|a</em>{T_i}|_1.
$$</p>
</li>
<li><p>&#x6700;&#x540E;&#xFF0C;&#x9274;&#x522B;&#x7B97;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x5230;&#x5177;&#x6709;&#x76F8;&#x5E94;&#x6807;&#x7B7E;&#x7684;$${a_{T_i}^*}^{&apos;}$$,&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x5206;&#x7C7B;&#x6216;&#x6216;&#x56DE;&#x5F52;&#x6A21;&#x578B;&#x7528;&#x4E8E;&#x76EE;&#x6807;&#x57DF;&#xFF0C;&#x4F46;&#x5728;&#x6E90;&#x57DF;&#x4E0A;&#x8BAD;&#x7EC3;&#x51FA;&#x7684;&#x57FA;&#x5411;&#x91CF;&#x53EF;&#x80FD;&#x5E76;&#x4E0D;&#x9002;&#x5408;&#x5728;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x4F7F;&#x7528;</p>
</li>
</ol>
</li>
<li><p>&#x6709;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x666E;&#x7F57;&#x79D1;&#x65AF;&#x7279;&#x65AF;&#x5206;&#x6790;&#x7684;&#x6D41;&#x5F62;&#x5BF9;&#x9F50;&#x65B9;&#x6CD5;&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x9F50;&#x7684;&#x6D41;&#x5F62;&#x8FDB;&#x884C;&#x77E5;&#x8BC6;&#x7684;&#x8DE8;&#x57DF;&#x4F20;&#x9012;</p>
</li>
</ul>
<h3 id="&#x4F20;&#x9012;&#x53C2;&#x6570;&#x77E5;&#x8BC6;">&#x4F20;&#x9012;&#x53C2;&#x6570;&#x77E5;&#x8BC6;</h3>
<ul>
<li>&#x672C;&#x8282;&#x63CF;&#x8FF0;&#x7684;&#x65B9;&#x6CD5;&#x591A;&#x4E3A;&#x591A;&#x4EFB;&#x52A1;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x5B83;&#x4E5F;&#x5BB9;&#x6613;&#x88AB;&#x4FEE;&#x6539;&#x5230;&#x5E94;&#x7528;&#x81F3;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x3002;&#x6211;&#x4EEC;&#x5E94;&#x5F53;&#x5728;&#x76EE;&#x6807;&#x57DF;&#x4E0A;&#x7684;&#x635F;&#x5931;&#x51FD;&#x6570;&#x5206;&#x914D;&#x66F4;&#x5927;&#x7684;&#x6743;&#x91CD;</li>
</ul>
<h3 id="&#x4F20;&#x9012;&#x5173;&#x7CFB;&#x77E5;&#x8BC6;">&#x4F20;&#x9012;&#x5173;&#x7CFB;&#x77E5;&#x8BC6;</h3>
<p><code>i.i.d: &#x72EC;&#x7ACB;&#x540C;&#x5206;&#x5E03;</code></p>
<blockquote>
<p>&#x5B83;&#x8BD5;&#x56FE;&#x5C06;&#x6570;&#x636E;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x4ECE;&#x6E90;&#x57DF;&#x8F6C;&#x79FB;&#x5230;&#x76EE;&#x6807;&#x57DF;&#x3002;</p>
</blockquote>
<ul>
<li>TAMAR&#x7B97;&#x6CD5;&#xFF1A;&#x5229;&#x7528;&#x9A6C;&#x5C14;&#x79D1;&#x592B;&#x903B;&#x8F91;&#x7F51;&#x7EDC;&#x5728;&#x5173;&#x7CFB;&#x57DF;&#x4E2D;&#x4F20;&#x9012;&#x5173;&#x7CFB;&#x77E5;&#x8BC6;&#x3002;<ul>
<li>&#x57FA;&#x7840;&#xFF1A;&#x5982;&#x679C;&#x4E24;&#x4E2A;&#x57DF;&#x9879;&#x76EE;&#x5173;&#x8054;&#xFF0C;&#x5219;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x4ECE;&#x6E90;&#x57DF;&#x5230;&#x76EE;&#x6807;&#x57DF;&#x8FDE;&#x63A5;&#x5B9E;&#x4F53;&#x53CA;&#x5176;&#x5173;&#x7CFB;&#x7684;&#x6620;&#x5C04;</li>
<li>&#x4E24;&#x4E2A;&#x9636;&#x6BB5;<ul>
<li>&#x57FA;&#x4E8E;&#x52A0;&#x6743;&#x4F2A;&#x5BF9;&#x6570;&#x4F3C;&#x7136;&#x5EA6;&#x91CF;&#xFF08;WPLL&#xFF09;&#xFF0C;&#x6784;&#x5EFA;&#x4ECE;&#x6E90;&#x57DF;&#x5230;&#x76EE;&#x6807;&#x57DF;&#x7684;&#x6620;&#x5C04;</li>
<li>&#x901A;&#x8FC7;FORTE&#x7B97;&#x6CD5;(&#x7528;&#x4E8E;&#x4FEE;&#x6539;&#x4E00;&#x9636;&#x7406;&#x8BBA;&#x7684;&#x9B3C;&#x9A6C;&#x903B;&#x8F91;&#x7F16;&#x7A0B;&#xFF08;ILP&#xFF09;suanfa )&#x5BF9;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x7684;&#x6620;&#x5C04;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4FEE;&#x6539;</li>
</ul>
</li>
</ul>
</li>
</ul>
<h2 id="&#x8F6C;&#x5BFC;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;">&#x8F6C;&#x5BFC;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;</h2>
<p>&#x8981;&#x6C42;&#x6E90;&#x4EFB;&#x52A1;&#x548C;&#x76EE;&#x6807;&#x4EFB;&#x52A1;&#x76F8;&#x540C;&#xFF0C;&#x5C3D;&#x7BA1;&#x57DF;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#x3002;&#x8FDB;&#x4E00;&#x6B65;&#x8981;&#x6C42;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x4E5F;&#x662F;&#x53EF;&#x7528;&#x7684;&#x3002;</p>
<p>&#x8F6C;&#x5BFC;&#x6709;&#x51E0;&#x79CD;&#x542B;&#x4E49;&#xFF1A;</p>
<ul>
<li>&#x5728;&#x4F20;&#x7EDF;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#xFF0C;&#x5B83;&#x8981;&#x6C42;&#x5728;&#x8BAD;&#x7EC3;&#x65F6;&#x770B;&#x5230;&#x6240;&#x6709;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#xFF0C;&#x4E14;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x6A21;&#x578B;&#x4E0D;&#x80FD;&#x88AB;&#x7528;&#x4E0E;&#x672A;&#x6765;&#x7684;&#x6570;&#x636E;&#x3002;</li>
<li>&#x5728;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7684;&#x5206;&#x7C7B;&#x4E2D;&#xFF0C;&#x7528;&#x6765;&#x5F3A;&#x8C03;&#x4EFB;&#x52A1;&#x5FC5;&#x987B;&#x76F8;&#x540C;&#xFF0C;&#x4E14;&#x5728;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x5FC5;&#x987B;&#x6709;&#x4E00;&#x4E9B;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#x53EF;&#x7528;</li>
</ul>
<p><strong>&#x5B9A;&#x4E49;3(&#x8F6C;&#x5BFC;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;)</strong>&#xFF1A;&#x7ED9;&#x5B9A;$$D_S,T_S,D_T,T_T$$&#xFF0C;&#x5B83;&#x65E8;&#x5728;&#x4F7F;&#x7528;&#x6E90;&#x57DF;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x63D0;&#x9AD8;&#x5728;&#x76EE;&#x6807;&#x57DF;&#x4E0A;&#x7684;&#x9884;&#x6D4B;&#x51FD;&#x6570;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x4E00;&#x4E9B;&#x672A;&#x6807;&#x8BB0;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x9700;&#x8981;&#x88AB;&#x7528;&#x5230;&#x3002;</p>
<p>&#x8F6C;&#x5BFC;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4E3B;&#x8981;&#x6709;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;1&#xFF09;&#x6E90;&#x57DF;&#x548C;&#x76EE;&#x6807;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x4E0D;&#x540C;&#xFF1B;2&#xFF09;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#x76F8;&#x540C;&#xFF0C;&#x4F46;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x8FB9;&#x7F18;&#x5206;&#x5E03;&#x6982;&#x7387;&#x51FD;&#x6570;&#x4E0D;&#x540C;</p>
<h3 id="&#x5B9E;&#x4F8B;&#x77E5;&#x8BC6;&#x7684;&#x8F6C;&#x79FB;">&#x5B9E;&#x4F8B;&#x77E5;&#x8BC6;&#x7684;&#x8F6C;&#x79FB;</h3>
<blockquote>
<p>&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7406;&#x8BBA; &#x4E4B; &#x7ECF;&#x9A8C;&#x98CE;&#x9669;&#x6700;&#x5C0F;&#x5316;&#xFF08;Empirical Risk Minimization&#xFF09;</p>
</blockquote>
<h3 id="&#x4F20;&#x9012;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;">&#x4F20;&#x9012;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;</h3>
<ul>
<li><code>Blitzer</code>&#x7B49;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x7ED3;&#x6784;&#x5BF9;&#x5E94;&#x5B66;&#x4E60;&#xFF08;SCL&#xFF09;&#x7B97;&#x6CD5;&#xFF0C;&#x5229;&#x7528;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x7684;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x63D0;&#x53D6;&#x51FA;&#x4E00;&#x4E9B;&#x5173;&#x952E;&#x7279;&#x5F81;&#xFF0C;&#x4EE5;&#x51CF;&#x5C0F;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#x3002;<ul>
<li>&#x7B2C;&#x4E00;&#x6B65;&#x662F;&#x5728;&#x6765;&#x81EA;&#x4E24;&#x4E2A;&#x57DF;&#x7684;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x4E0A;&#x5B9A;&#x4E49;&#x4E00;&#x7EC4;&#x4E2D;&#x67A2;&#x7279;&#x5F81;&#xFF08;&#x5171;m&#x4E2A;&#xFF09;</li>
<li>&#x4ECE;&#x6570;&#x636E;&#x4E2D;&#x79FB;&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x67A2;&#x8F74;&#x7279;&#x5F81;&#x540E;&#xFF0C;&#x5C06;&#x6BCF;&#x4E2A;&#x67A2;&#x8F74;&#x89C6;&#x4E3A;&#x65B0;&#x7684;&#x6807;&#x7B7E;&#x5411;&#x91CF;&#xFF0C;&#x53EF;&#x4EE5;&#x6784;&#x9020;m&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;
$$f_l(x)=sgn(w_l^T \cdot x),\quad l=1,...,m.$$
SCI&#x53EF;&#x4EE5;&#x5B66;&#x4E60;&#x77E9;&#x9635;$$W=[w_1 w_2...w_m]$$&#x4E2D;&#x7684;&#x53C2;&#x6570;</li>
<li>&#x5C06;&#x5947;&#x5F02;&#x503C;&#x5206;&#x89E3;&#x5E94;&#x7528;&#x4E8E;&#x77E9;&#x9635;W</li>
</ul>
</li>
<li>SCL&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x57DF;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x4F46;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x4E2D;&#x67A2;&#x7279;&#x5F81;&#x662F;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x5E76;&#x53D6;&#x51B3;&#x4E8E;&#x9886;&#x57DF;</li>
<li>&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x4E92;&#x4FE1;&#x606F;&#x6765;&#x9009;&#x62E9;&#x67A2;&#x8F74;&#x7279;&#x5F81;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4F7F;&#x7528;&#x66F4;&#x591A;&#x7684;&#x542F;&#x53D1;&#x5F0F;&#x6807;&#x51C6;</li>
</ul>
<h2 id="&#x65E0;&#x76D1;&#x7763;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;">&#x65E0;&#x76D1;&#x7763;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;</h2>
<p><strong>&#x5B9A;&#x4E49;4(&#x65E0;&#x76D1;&#x7763;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;)</strong>&#xFF1A;&#x7ED9;&#x5B9A;$$T_S,D_S,D_T,T_T$$,&#x5B83;&#x7684;&#x76EE;&#x7684;&#x4E0E;&#x524D;&#x51E0;&#x4E2A;&#x5B9A;&#x4E49;&#x4E2D;&#x7684;&#x76EE;&#x7684;&#x7C7B;&#x4F3C;&#xFF0C;$$T_S \neq T_T$$ &#x4E14;$$y_S$$&#x548C;$$y_T$$&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x89C2;&#x6D4B;&#x7684;</p>
<p>&#x81EA;&#x5B66;&#x805A;&#x7C7B;&#xFF08;STC&#xFF09;&#x548C;&#x8F6C;&#x79FB;&#x5224;&#x522B;&#x5206;&#x6790;&#xFF08;TDA&#xFF09;&#x7B97;&#x6CD5;&#x5206;&#x522B;&#x63D0;&#x51FA;&#x6765;&#x8F6C;&#x79FB;&#x805A;&#x7C7B;&#x548C;&#x8F6C;&#x79FB;&#x964D;&#x7EF4;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="&#x8FC1;&#x79FB;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;">&#x8FC1;&#x79FB;&#x7279;&#x5F81;&#x8868;&#x793A;&#x7684;&#x77E5;&#x8BC6;</h3>
<p><code>dai</code>&#x7B49;&#x4EBA;&#x7814;&#x7A76;&#x4E86;&#x4E00;&#x79CD;&#x81EA;&#x5B66;&#x805A;&#x7C7B;&#xFF08;STC&#xFF09;&#xFF0C;&#x501F;&#x52A9;&#x6E90;&#x57DF;&#x4E2D;&#x5927;&#x91CF;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#xFF0C;&#x5BF9;&#x76EE;&#x6807;&#x57DF;&#x4E2D;&#x7684;&#x5C11;&#x91CF;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x805A;&#x7C7B;&#x3002;&#x5B83;&#x7684;&#x76EE;&#x6807;&#x51FD;&#x6570;&#x5982;&#x4E0B;&#x8868;&#x793A;
<img src="../images/1619009110197.png" alt="1619009110197"></p>
<blockquote>
<p>Z&#x8868;&#x793A;$$X_S$$&#x548C; $$X_T$$&#x7684;&#x5171;&#x4EAB;&#x7279;&#x5F81;&#x7A7A;&#x95F4;&#xFF0C;I&#x8868;&#x793A;&#x4E24;&#x4E2A;&#x53D8;&#x91CF;&#x4E4B;&#x95F4;&#x7684;&#x4E92;&#x4FE1;&#x606F;&#xFF0C;$$\vec{X_T}$$&#x662F;$$X_T$$ &#x5BF9;&#x5E94;&#x7684;&#x7C07;</p>
</blockquote>
<p>&#x6211;&#x4EEC;&#x5219;&#x901A;&#x8FC7;&#x4E00;&#x4EE5;&#x4E0B;&#x7684;&#x4F18;&#x5316;&#x51FD;&#x6570;&#x5B66;&#x4E60;$$\vec{X_T}$$
<img src="../images/1619009611933.png" alt="1619009611933"></p>
<p><code>Wang</code>&#x7B49;&#x4EBA;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;TDA&#x7B97;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x8F6C;&#x79FB;&#x4F4D;&#x6570;&#x7EA6;&#x51CF;&#x95EE;&#x9898;&#x3002;&#x5B83;&#x9996;&#x5148;&#x5E94;&#x7528;&#x805A;&#x7C7B;&#x65B9;&#x6CD5;&#x4E3A;&#x76EE;&#x6807;&#x672A;&#x6807;&#x8BB0;&#x6570;&#x636E;&#x751F;&#x6210;&#x4F2A;&#x6807;&#x7B7E;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x5BF9;&#x76EE;&#x6807;&#x6570;&#x636E;&#x548C;&#x6709;&#x6807;&#x8BB0;&#x7684;&#x6E90;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x964D;&#x7EF4;&#x3002;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x8FED;&#x4EE3;&#x8FDB;&#x884C;&#xFF0C;&#x4F7F;&#x5F97;&#x76EE;&#x6807;&#x6570;&#x636E;&#x627E;&#x5230;&#x6700;&#x4F73;&#x5B50;&#x7A7A;&#x95F4;</p>
<h2 id="&#x8F6C;&#x79FB;&#x754C;&#x9650;&#x548C;&#x8D1F;&#x8F6C;&#x79FB;">&#x8F6C;&#x79FB;&#x754C;&#x9650;&#x548C;&#x8D1F;&#x8F6C;&#x79FB;</h2>
<p>&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA4;&#x8BC6;&#x5230;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x7684;&#x5C40;&#x9650;&#x6027;</p>
<ul>
<li><code>mahmud</code> &#x548C; <code>Ray</code>&#x4F7F;&#x7528; Kolmogorov &#x590D;&#x6742;&#x5EA6;&#x5206;&#x6790;&#x4E86;&#x8FC1;&#x79FB;&#x5B66;&#x4E60;&#x4E2D;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x5B83;&#x6765;&#x5EA6;&#x91CF;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x76F8;&#x5173;&#x6027;</li>
<li><code>Eaton</code>&#x63D0;&#x51FA;&#x4E86;&#x901A;&#x8FC7;&#x5C06;&#x5B66;&#x4E60;&#x7684;&#x6E90;&#x6A21;&#x578B;&#x6620;&#x5C04;&#x5230;&#x56FE;&#x4E2D;&#xFF0C;&#x8BA9;&#x6E90;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x6765;&#x5EA6;&#x91CF;&#x53EF;&#x8FC1;&#x79FB;&#x6027;</li>
</ul>
<h2 id="&#x603B;&#x7ED3;">&#x603B;&#x7ED3;</h2>
<ul>
<li>&#x672A;&#x6765;&#x5B9A;&#x4E49;&#x57DF;&#x548C;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x53EF;&#x8FC1;&#x79FB;&#x6027;&#xFF0C;&#x8FD8;&#x9700;&#x5B9A;&#x4E49;&#x5EA6;&#x91CF;&#x57DF;&#x6216;&#x4EFB;&#x52A1;&#x4E4B;&#x95F4;&#x76F8;&#x4F3C;&#x6027;&#x7684;&#x6807;&#x51C6;</li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 2.迁移学习论文研读">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"A Survey on Transfer Learning","level":"1.3.1","depth":2,"previous":{"title":"2.迁移学习论文研读","level":"1.3","depth":1,"path":"迁移学习论文研读/README.md","ref":"迁移学习论文研读/README.md","articles":[{"title":"A Survey on Transfer Learning","level":"1.3.1","depth":2,"path":"迁移学习论文研读/A Survey on Transfer Learning.md","ref":"迁移学习论文研读/A Survey on Transfer Learning.md","articles":[]}]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"迁移学习论文研读/A Survey on Transfer Learning.md","mtime":"2021-05-29T01:09:45.339Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2021-05-29T01:46:56.741Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

